tap "antoniorodr/memo"
tap "felixkratz/formulae", "https://github.com/FelixKratz/homebrew-formulae", trusted: true
tap "nikitabobko/tap", trusted: true
tap "qmk/qmk", trusted: { formulae: ["qmk"] }
tap "romkatv/powerlevel10k"
# GNU compiler collection for arm-none-eabi
brew "arm-none-eabi-gcc"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Defines a standard way of committing rules and communicating it
brew "commitizen"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Modern diagram scripting language that turns text to diagrams
brew "d2"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Framework for layout and rendering of i18n text
brew "pango"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# CLI for Drive, Gmail, Calendar, Sheets, Docs, Chat, Admin, and more
brew "googleworkspace-cli"
# Image processing tools collection
brew "graphicsmagick"
# Library for communicating with USB and Bluetooth HID devices
brew "hidapi"
# Simple terminal UI for git commands
brew "lazygit"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Development kit for the Java programming language
brew "openjdk@17"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@15"
# Theme for zsh
brew "powerlevel10k"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Ruby version manager
brew "rbenv"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar (barra tipo waybar)
brew "sketchybar"
# Tiling window manager estilo i3/Omarchy para macOS
cask "nikitabobko/tap/aerospace"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
# Iconos de apps para SketchyBar
cask "font-sketchybar-app-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
npm "@expo/ngrok"
npm "corepack"
npm "eas-cli"
